{"links": {"self": {"href": "data/repositories/osrf/gazebo/issues/1294/comments/13068692.json"}, "html": {"href": "#!/osrf/gazebo/issues/1294#comment-13068692"}}, "issue": {"links": {"self": {"href": "data/repositories/osrf/gazebo/issues/1294.json"}}, "type": "issue", "id": 1294, "repository": {"links": {"self": {"href": "data/repositories/osrf/gazebo.json"}, "html": {"href": "#!/osrf/gazebo"}, "avatar": {"href": "data/bytebucket.org/ravatar/{51a0cd5d-8697-4eb1-8b08-e919ee881e1c}ts=1694483"}}, "type": "repository", "name": "gazebo", "full_name": "osrf/gazebo", "uuid": "{51a0cd5d-8697-4eb1-8b08-e919ee881e1c}"}, "title": "Inclusion of magnetic field strength sensor"}, "content": {"raw": "Just for the record: [hector_gazebo_plugins](http://wiki.ros.org/hector_gazebo_plugins#GazeboRosMagnetic) provides a 3D magnetic field sensor simulation as a ROS plugin since 2012. We use it successfully for our quadrotor simulation based on Gazebo: [hector_quadrotor](http://wiki.ros.org/hector_quadrotor).\n\nIt should be noted that the magnetic field is not at all parallel to the earth surface except near the equator. The [magnetic inclination](http://en.wikipedia.org/wiki/Magnetic_dip) is about 60 degrees in Europe and in the US and grows to 90 degrees when coming closer to the poles. So the vertical component is even larger than the horizontal one. The angle between true and magnetic north is called [declination](http://en.wikipedia.org/wiki/Magnetic_declination).\n\n`GazeboRosMagnetic` in hector_gazebo_plugins has the declination, inclination and magnitude as plugin parameters and uses them to calculate the earth fixed magnetic field vector. I would propose to make these three parameters properties of the world instead of the vector itself as they are easier to lookup in the web or at least it is easier to assign reasonable default values. I usually use the [NOAA magnetic field calculator](http://www.ngdc.noaa.gov/geomag-web/) based on their World Magnetic Model (WMM2010).\n\nWith respect to terminology the term IMU is often misused for what should be an AHRS in the robotics community. Originally (in the navigation community) an \"**IMU**\" (Inertial *Measurement* Unit) is nothing more than a  sensor unit consisting of a (3-axis) gyroscope and a (3-axis) accelerometer and measures angular rates and accelerations (including gravity) in the body frame. With high-grade gyroscopes the angular rate signals can be integrated to a relative orientation, but the MEMS sensors that are affordable and commonly used in robotics applications have too much noise and drift and pure integration would be useless. If combined with an estimator that fuses angular rates and accelerations such a device is called an \"**ARS**\" (Attitude Reference System) or \"**IRS**\" (Inertial Reference System) that outputs the roll and pitch angle. Only with an additional magnetic field sensor the absolute yaw angle is also observable, making the ARS an \"**AHRS**\" (Attitude and Heading Reference System). The acronym \"**MARG**\" (Magnetic, Angular Rate, and Gravity) is used for the sensor array within an AHRS. Last but not least, if the system also integrates the measured accelerations and outputs velocities or even position it is usually called an \"**INS**\" (Inertial Navigation System). Again, with MEMS sensors pure integration without external aiding (e.g. by GNSS) would be useless as the error would grow too fast. These definitions can be found in many text books about the topic and also at the [Xsens web page](https://www.xsens.com/tags/ahrs/).\n\nTo come back to the original topic of this issue: A magnetic field sensor is an independent sensor and should not be integrated in the IMU sensor plugin.", "markup": "markdown", "html": "<p>Just for the record: <a data-is-external-link=\"true\" href=\"http://wiki.ros.org/hector_gazebo_plugins#GazeboRosMagnetic\" rel=\"nofollow\">hector_gazebo_plugins</a> provides a 3D magnetic field sensor simulation as a ROS plugin since 2012. We use it successfully for our quadrotor simulation based on Gazebo: <a data-is-external-link=\"true\" href=\"http://wiki.ros.org/hector_quadrotor\" rel=\"nofollow\">hector_quadrotor</a>.</p>\n<p>It should be noted that the magnetic field is not at all parallel to the earth surface except near the equator. The <a data-is-external-link=\"true\" href=\"http://en.wikipedia.org/wiki/Magnetic_dip\" rel=\"nofollow\">magnetic inclination</a> is about 60 degrees in Europe and in the US and grows to 90 degrees when coming closer to the poles. So the vertical component is even larger than the horizontal one. The angle between true and magnetic north is called <a data-is-external-link=\"true\" href=\"http://en.wikipedia.org/wiki/Magnetic_declination\" rel=\"nofollow\">declination</a>.</p>\n<p><code>GazeboRosMagnetic</code> in hector_gazebo_plugins has the declination, inclination and magnitude as plugin parameters and uses them to calculate the earth fixed magnetic field vector. I would propose to make these three parameters properties of the world instead of the vector itself as they are easier to lookup in the web or at least it is easier to assign reasonable default values. I usually use the <a data-is-external-link=\"true\" href=\"http://www.ngdc.noaa.gov/geomag-web/\" rel=\"nofollow\">NOAA magnetic field calculator</a> based on their World Magnetic Model (WMM2010).</p>\n<p>With respect to terminology the term IMU is often misused for what should be an AHRS in the robotics community. Originally (in the navigation community) an \"<strong>IMU</strong>\" (Inertial <em>Measurement</em> Unit) is nothing more than a  sensor unit consisting of a (3-axis) gyroscope and a (3-axis) accelerometer and measures angular rates and accelerations (including gravity) in the body frame. With high-grade gyroscopes the angular rate signals can be integrated to a relative orientation, but the MEMS sensors that are affordable and commonly used in robotics applications have too much noise and drift and pure integration would be useless. If combined with an estimator that fuses angular rates and accelerations such a device is called an \"<strong>ARS</strong>\" (Attitude Reference System) or \"<strong>IRS</strong>\" (Inertial Reference System) that outputs the roll and pitch angle. Only with an additional magnetic field sensor the absolute yaw angle is also observable, making the ARS an \"<strong>AHRS</strong>\" (Attitude and Heading Reference System). The acronym \"<strong>MARG</strong>\" (Magnetic, Angular Rate, and Gravity) is used for the sensor array within an AHRS. Last but not least, if the system also integrates the measured accelerations and outputs velocities or even position it is usually called an \"<strong>INS</strong>\" (Inertial Navigation System). Again, with MEMS sensors pure integration without external aiding (e.g. by GNSS) would be useless as the error would grow too fast. These definitions can be found in many text books about the topic and also at the <a data-is-external-link=\"true\" href=\"https://www.xsens.com/tags/ahrs/\" rel=\"nofollow\">Xsens web page</a>.</p>\n<p>To come back to the original topic of this issue: A magnetic field sensor is an independent sensor and should not be integrated in the IMU sensor plugin.</p>", "type": "rendered"}, "created_on": "2014-10-18T21:04:59.587779+00:00", "user": {"display_name": "Johannes Meyer", "uuid": "{58d19163-cefc-479b-b80a-d78fb811b533}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B58d19163-cefc-479b-b80a-d78fb811b533%7D"}, "html": {"href": "https://bitbucket.org/%7B58d19163-cefc-479b-b80a-d78fb811b533%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/1363fb056a859ce072c21fdb8da3a710d=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsJM-6.png"}}, "nickname": "johmeyer", "type": "user", "account_id": "557058:7237c8c3-e637-4ea0-ab9c-d45f303d8fb9"}, "updated_on": null, "type": "issue_comment", "id": 13068692}