{"links": {"self": {"href": "data/repositories/osrf/gazebo/issues/2489/comments/47438404.json"}, "html": {"href": "#!/osrf/gazebo/issues/2489#comment-47438404"}}, "issue": {"links": {"self": {"href": "data/repositories/osrf/gazebo/issues/2489.json"}}, "type": "issue", "id": 2489, "repository": {"links": {"self": {"href": "data/repositories/osrf/gazebo.json"}, "html": {"href": "#!/osrf/gazebo"}, "avatar": {"href": "data/bytebucket.org/ravatar/{51a0cd5d-8697-4eb1-8b08-e919ee881e1c}ts=1694483"}}, "type": "repository", "name": "gazebo", "full_name": "osrf/gazebo", "uuid": "{51a0cd5d-8697-4eb1-8b08-e919ee881e1c}"}, "title": "Collada loader failing at loading Blender exported dae rigged model with motion tracking animation attached to it."}, "content": {"raw": "Also if I remember well one of the issues I was having, was that I was trying to get animations working on a `model` tag instead of an `actor` tag in the sdf file.\nSince I was trying to retrieve forces applied to different joints in motion from the humanoid animations (basically retrieve forces from walking motion). \nI think that patch I had done was because the system doesn't load the bones nor joint transforms when trying to be loaded by the `model` tag since the `model` tag\ndoesn't support animations. \nThe only tag that handles animations is the `actor` tag in which case gazebo loads the bones and joint transforms to prevent these types of crashes.\n\nI think it would be a good feature to add in the future to be able to retrieve transformation forces from animated models. I attached an Inertial Measurement Unit to the chest of an animated humanoid model with scripted routes (for displacement purposes) and I couldn't retrieve any angular velocities or linear accelerations that were coherent with the model's motion from Gazebo as the `actor` subsystem doesn't handle forces from the physics engine.\n\nHope the feedback helps.", "markup": "markdown", "html": "<p>Also if I remember well one of the issues I was having, was that I was trying to get animations working on a <code>model</code> tag instead of an <code>actor</code> tag in the sdf file.\nSince I was trying to retrieve forces applied to different joints in motion from the humanoid animations (basically retrieve forces from walking motion). \nI think that patch I had done was because the system doesn't load the bones nor joint transforms when trying to be loaded by the <code>model</code> tag since the <code>model</code> tag\ndoesn't support animations. \nThe only tag that handles animations is the <code>actor</code> tag in which case gazebo loads the bones and joint transforms to prevent these types of crashes.</p>\n<p>I think it would be a good feature to add in the future to be able to retrieve transformation forces from animated models. I attached an Inertial Measurement Unit to the chest of an animated humanoid model with scripted routes (for displacement purposes) and I couldn't retrieve any angular velocities or linear accelerations that were coherent with the model's motion from Gazebo as the <code>actor</code> subsystem doesn't handle forces from the physics engine.</p>\n<p>Hope the feedback helps.</p>", "type": "rendered"}, "created_on": "2018-08-24T19:28:34.716417+00:00", "user": {"display_name": "Lucas MCKENNA", "uuid": "{04c81126-5e89-43cc-a7a1-0e15a3bda5c1}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B04c81126-5e89-43cc-a7a1-0e15a3bda5c1%7D"}, "html": {"href": "https://bitbucket.org/%7B04c81126-5e89-43cc-a7a1-0e15a3bda5c1%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/557058:34645962-e4f3-4c98-a6cf-8cf3008dac93/0b7e8a08-facb-4681-bb8e-63662b0e0356/128"}}, "nickname": "lukes3315", "type": "user", "account_id": "557058:34645962-e4f3-4c98-a6cf-8cf3008dac93"}, "updated_on": "2018-08-24T19:35:31.032644+00:00", "type": "issue_comment", "id": 47438404}